Melting/test_tri/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //





   	convertToMeters 0.001;

   	 //40.0 mm width
   	 //40.0 mm heigth
   	 //40.0 mm thickness
   	 //2 mm boundary layer

   	 //cells boundary layer
	 //cells center block
     //cells center block
   
     //grading factor

	
   	
   	
   	
   	
   	
   	
   	
   	
   
   	vertices
   	(
    	( 0.0 0.0 0.0) // Vertex v00 = 0 
    	( 2 0.0 0.0) // Vertex v01 = 1 
    	( 2 2 0.0) // Vertex v02 = 2 
    	( 0.0 2 0.0) // Vertex v03 = 3 
   
    	( 38 0.0 0.0) // Vertex v04 = 4 
    	( 40.0 0.0 0.0) // Vertex v05 = 5 
    	( 40.0 2 0.0) // Vertex v06 = 6 
    	( 38 2 0.0) // Vertex v07 = 7 

    	( 38 38 0.0) // Vertex v08 = 8 
    	( 40.0 38 0.0) // Vertex v09 = 9 
    	( 40.0 40.0 0.0) // Vertex v10 = 10 
    	( 38 40.0 0.0) // Vertex v11 = 11 

    	( 0.0 38 0.0) // Vertex v12 = 12 
    	( 2 38 0.0) // Vertex v13 = 13 
    	( 2 40.0 0.0) // Vertex v14 = 14 
    	( 0.0 40.0 0.0) // Vertex v15 = 15 
   
    	( 0.0 0.0 40.0) // Vertex v16 = 16 
    	( 2 0.0 40.0) // Vertex v17 = 17 
    	( 2 2 40.0) // Vertex v18 = 18 
    	( 0.0 2 40.0) // Vertex v19 = 19 
   
    	( 38 0.0 40.0) // Vertex v20 = 20 
    	( 40.0 0.0 40.0) // Vertex v21 = 21 
    	( 40.0 2 40.0) // Vertex v22 = 22 
    	( 38 2 40.0) // Vertex v23 = 23 

    	( 38 38 40.0) // Vertex v24 = 24 
    	( 40.0 38 40.0) // Vertex v25 = 25 
    	( 40.0 40.0 40.0) // Vertex v26 = 26 
    	( 38 40.0 40.0) // Vertex v27 = 27 

    	( 0.0 38 40.0) // Vertex v28 = 28 
    	( 2 38 40.0) // Vertex v29 = 29 
    	( 2 40.0 40.0) // Vertex v30 = 30 
    	( 0.0 40.0 40.0) // Vertex v31 = 31 
   	);				

   	blocks
   	(
    	hex (0 1 2 3 16 17 18 19) (10 10 1) simpleGrading (6.5 6.5 1)
        hex (1 4 7 2 17 20 23 18) (80 10 1) simpleGrading (1 6.5 1)
        hex (4 5 6 7 20 21 22 23) (10 10 1) simpleGrading (0.153846153846154 6.5 1)
        hex (3 2 13 12 19 18 29 28) (10 80 1) simpleGrading (6.5 1 1)
        hex (2 7 8 13 18 23 24 29) (80 80 1) simpleGrading (1 1 1)
        hex (7 6 9 8 23 22 25 24) (10 80 1) simpleGrading (0.153846153846154 1 1)
    	hex (12 13 14 15 28 29 30 31) (10 10 1) simpleGrading (6.5 0.153846153846154 1)
        hex (13 8 11 14 29 24 27 30) (80 10 1) simpleGrading (1 0.153846153846154 1)
        hex (8 9 10 11 24 25 26 27) (10 10 1) simpleGrading (0.153846153846154 0.153846153846154 1)
    	
   	);

   	edges
   	(
   	);

   	patches
   	(
        wall upperWall 
        (
            (14 30 27 11)
            (11 27 26 10)
            (15 31 30 14)
        )
        wall leftWall
        (
            (0 16 19 3)
            (3 19 28 12)
            (12 28 31 15) 
        )
        wall rightWall
        (
            (6 22 21 5)
            (9 25 22 6)
            (10 26 25 9)
        )
        wall lowerWall
        (
            (1 17 16 0)
            (4 20 17 1)
            (5 21 20 4)
        )
        empty frontAndBack 
        (
            (3 2 1 0)
            (2 7 4 1)
            (7 6 5 4)
            (12 13 2 3)
            (13 8 7 2)
            (8 9 6 7)
            (15 14 13 12)
            (14 11 8 13)
            (11 10 9 8)

            (16 17 18 19)
            (17 20 23 18)
            (20 21 22 23)
            (19 18 29 28)
            (18 23 24 29)
            (23 22 25 24)
            (28 29 30 31)
            (29 24 27 30)
            (24 25 26 27)
        )
	);

